benchmark/old_outputs/sieve_fig_med/lru/8_clients_1_1/2026-04-20T19:53:46-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 4187524
number of failed transactions: 0 (0.000%)
latency average = 0.344 ms
initial connection time = 11.985 ms
tps = 23265.529053 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 50.0% of total)
 - 2093702 transactions (50.0% of total)
 - number of transactions actually processed: 2093702 (tps = 11632.431172)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.111 ms
 - latency stddev = 0.105 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 50.0% of total)
 - 2093822 transactions (50.0% of total)
 - number of transactions actually processed: 2093822 (tps = 11633.097881)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.570 ms
 - latency stddev = 0.572 ms
ratio: .9613004637592221